src/extensions/ДокументооборотКОРП_ДополнительныеОбработчикиДляПроцессов/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ДополнительныеРеквизитыИСведения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЗначенияИспользуются</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЗначенияСВесом</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьОбязательно</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеСведение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/extensions/ДокументооборотКОРП_ДополнительныеОбработчикиДляПроцессов/Catalogs/НаборыДополнительныхРеквизитовИСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НаборыДополнительныхРеквизитовИСведений</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/extensions/ДокументооборотКОРП_ДополнительныеОбработчикиДляПроцессов/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НайтиСоздатьСвойство_Важность() Экспорт
	
	ИдентификаторСсылки = Новый УникальныйИдентификатор("e9020a8b-982e-11e9-81ab-00155d00f645");
	СвойствоСсылка = ПолучитьСсылку(ИдентификаторСсылки);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(СвойствоСсылка) Тогда 
		
		СвойствоОбъект = СоздатьЭлемент();
		СвойствоОбъект.УстановитьСсылкуНового(СвойствоСсылка);
		
		СвойствоОбъект.Наименование = НСтр(
			"ru = 'Важность'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		СвойствоОбъект.Заголовок = СвойствоОбъект.Наименование;
		СвойствоОбъект.ЭтоДополнительноеСведение = Ложь;
	
		СвойствоОбъект.УстановитьНовыйКод();
		
		СвойствоОбъект.Записать();
		
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции

Функция НайтиСоздатьСвойство_НаправлениеДеятельности() Экспорт
	
	ИдентификаторСсылки = Новый УникальныйИдентификатор("7edfb245-721b-47e6-b206-da3e55b9231c");
	СвойствоСсылка = ПолучитьСсылку(ИдентификаторСсылки);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(СвойствоСсылка) Тогда 
		
		СвойствоОбъект = СоздатьЭлемент();
		СвойствоОбъект.УстановитьСсылкуНового(СвойствоСсылка);
		
		СвойствоОбъект.Наименование = НСтр(
			"ru = 'Направление деятельности'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		СвойствоОбъект.Заголовок = СвойствоОбъект.Наименование;
		СвойствоОбъект.ЭтоДополнительноеСведение = Ложь;
		СвойствоОбъект.ЗаполнятьОбязательно = Ложь;
		СвойствоОбъект.ТипЗначения = Тип("СправочникСсылка.ЗначенияСвойствОбъектовИерархия");
	
		СвойствоОбъект.УстановитьНовыйКод();
		
		СвойствоОбъект.Записать();
		
		// И добавим его сразу в набор свойств подразделений
		НаборРеквизитовПодразделений = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_СтруктураПредприятия;
		НаборРеквизитовПодразделенийОбъект = НаборРеквизитовПодразделений.ПолучитьОбъект();
		НаборРеквизитовПодразделенийОбъект.ДополнительныеРеквизиты.Добавить().Свойство = СвойствоСсылка;
		НаборРеквизитовПодразделенийОбъект.Записать();
		
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции

Функция НайтиСоздатьСвойство_ДолжностьРаботника() Экспорт
	
	// TODO: заменить GUID и переписать
	ИдентификаторСсылки = Новый УникальныйИдентификатор("023803b3-fa2d-11e4-80fa-00155d00f647");
	СвойствоСсылка = ПолучитьСсылку(ИдентификаторСсылки);
	
	Если Не ОбщегоНазначения.СсылкаСуществует(СвойствоСсылка) Тогда 
		
		СвойствоОбъект = СоздатьЭлемент();
		СвойствоОбъект.УстановитьСсылкуНового(СвойствоСсылка);
		
		СвойствоОбъект.Наименование = НСтр(
			"ru = 'Должность работника'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		СвойствоОбъект.Заголовок = СвойствоОбъект.Наименование;
		СвойствоОбъект.ЭтоДополнительноеСведение = Ложь;
		СвойствоОбъект.ЗаполнятьОбязательно = Истина;
		СвойствоОбъект.ТипЗначения = Тип("СправочникСсылка.Должности");
	
		СвойствоОбъект.УстановитьНовыйКод();
		
		СвойствоОбъект.Записать();
		
		// TODO: добавить реквизит сразу в вид документа "Должностная инструкция"
		
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
